# Five important ways for Imputing Missing Values 

You can impute missing valued uisng machine learning models. This process is known as data imputation and is commonly used in data preprocessing to handle missing or incomplete data. Tehre are several methods and models you can use, depending on the nature of your data and the missing values;

1. `Simple Imputation Techniques:`
    - **Mean/Median Imputation:**: Replace missing values with the mean or median of the column. Suitable for numerical data. 
    - **Mode Imputation:** Replace missing values with the mode (most requent value) of the column. Useful for categorical data. 

2. `K-nearest Neighbors (KNN):` This algorithm can be usie to impute missing values base don the similarity of rows. 

3. `Regression Imputation:` Use a regression model to predict the missing vlaues base don other variables in your dataset. 

4. `Decision Trees and Random Forests:` These can handle missing values inherently. They can alos be uded to predict missin valued based on the patterns learned form the other data. 

5. `Advanced Techniques:`
    - **Multiple Imputation by Chained Equations(Mice):** This is a moere sphisticated technique that models each variable withmissing values as a function of other variables in a round-robin fashion. 
    - **Deep Learning Methods:** Neural networks, especially autoencoders, can be effective in imputing missing values in complex datasets.

6. ` Time Series Specific Methods:` For time-series data, you might use techniques like interpolatio forware-fill, or bacward-fill. 


It's important to choose the right method base on the type of data, the pattern of missingness (e.g., at random, completely at rndom, or not at randoma), and the amount of missing data, Additionally, it's crucial to understand that imputation can introduce bias or affect the distributtion of your data so it should be done with catution adn an understandin of the potential implicatins. 


### 1. Simple Imputation Techniques 

**1.1. Mean/Median Imputation** 
Mean/median impuation replaces missing values with the mean or median of the column. This is a simple and effective method but it has some limitations. For example, it reduces variance in the dataset, and it cna lead to biased estimates if the missing values are not missing at random. 

Let's see how to implement mean/median imputation in Python using the Titanic dataset. 



**1.1.1 Mean Imputation**
First, let's imprt the necessary libraries and load the dataset:

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
% matplotlib inline

UsageError: Line magic function `%` not found.

In [2]:
# Load the Titanic Dataset
data = sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# check the number of misssing values in each column 
data.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [4]:
# impute missing values with mean 
data['age'] = data['age'].fillna(data['age'].mean())

In [5]:
# check the number of missing values in each column 
data.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### **1.1.2 Median Imputation**

In [6]:
df = sns.load_dataset('titanic')
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [7]:
# impute missing values with median 
df['age'] = df['age'].fillna(df['age'].median())

In [8]:
# check the number of missing values in each column
df.isnull().sum().sort_values(ascending = False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### **1.2. Mode Imputation**

Mode imputation ereplaces missing values oeht the model( most equent values) of the column. this is useful for imputing categorical columns, such as `Embarked` and `embardk_town` in this titanic dataset. 


Let's see how to implement mode imputaiton in Python using the Titanic datast.

In [9]:
# Load the dataset 

df = sns.load_dataset('titanic')

In [11]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [12]:
# impute missing values with mode 
df['embark_town'] = df['embark_town'].fillna(df['embark_town'].mode()[0])
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])

In [13]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

We can see that the missing values in the   `embark_town` column and `embarked` column have been rrplaced with the mode of the column.

## 2. K-Nearest Neighbors(KNN)

KNN is a machine Learning algorithm that can be used for imputing missing values. It works by finding the most similar data pionts to the one with the missing values baed on other available featues. The missing value is then imputed with the mean or median of the similar data points. 

Let's see how to implement KNN imputation in Python using the Titanic dataset.

In [14]:
# Load the dataset 
df = sns.load_dataset('titanic')

In [15]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [17]:
# impute missing values with KNN imputer 
from sklearn.impute import KNNImputer

In [18]:
# call the KNN clas wiht number of neighbors =4 
imputer = KNNImputer (n_neighbors=4)

In [19]:
# impute missing values with KNN imputer 
df['age'] = imputer.fit_transform(df[['age']])

In [21]:
# check teh number fo missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

### 3. Regression Imputation

Regressin imputatin uses a regression model ot predict the missing values based on other variables in the dataset. It work well for both categorical and numerical data. 

Let's see how to impleent regression imputation in PYthon using the Titanic dataset

In [22]:
# load the dataset 
df =sns.load_dataset('titanic')

In [23]:
# check the number of missing values in each column 

df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [24]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [25]:
# impute missing values with regression impute 

from sklearn.experimental import enable_iterative_imputer 
from sklearn.impute import IterativeImputer

In [26]:
# call the IterativeImputer class with max_iter =10 
impute = IterativeImputer(max_iter=10)

In [29]:
# impute missing values with regression imputer 

df['age'] = imputer.fit_transform(df[['age']])

In [30]:
# check the number of missing values in each column 
df.isnull().sum().sort_values(ascending=False)

deck           688
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

## 4. Random Forests for Imputing Missing values

Random forests can handle missing values inherently. They can also be usedn ot predict missing values based on the patterns leanded from the other data. 

Let's see how to implement random forests in PYthon using the Titanic dataset.

In [32]:
import pandas as pd 
import numpy as np 

from sklearn.model_selection import train_test_split 
from sklearn.ensemble import RandomForestRegressor 
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, mean_absolute_percentage_error
from sklearn.impute import SimpleImputer

In [33]:
# load the dataset 

df = sns.load_dataset('titanic')

In [34]:
# check missing values in each columns 
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [35]:
# remove deck column 
df.drop('deck', axis=1, inplace=True)

In [36]:
# check missing values in each column 
df.isnull().sum().sort_values(ascending =False)

age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [37]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [38]:
# encode the data using label encoding 
from sklearn.preprocessing import LabelEncoder

In [39]:
# columsn ot encode 
columns_to_encode = ['sex', 'embarked', 'who', 'class', 'embark_town', 'alive']

In [40]:
# Dictionary to store LabelEncoders for each column 
label_encoders ={}

In [41]:
# loop to apply LabelEncoder to each column 
for col in columns_to_encode:
    # creat a new LabelEncoder for the column 
    le = LabelEncoder()

    # fit the transform the data, then inverse transform it 
    df[col] = le.fit_transform(df[col])


    # store the encoder in the dictionary 
    label_encoders[col] =le

In [42]:
# check the first few rows of the DataFrame 
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,2,0,True

We have to first impute the missing values in the gage column before we can use it to predict the missing vlaues in the `embarked` and `embark_town` columns.

In [43]:
# split the dataset into two parts; one with missing values, one without 
df_with_missing = df[df['age'].isna()]

In [44]:
# dropna remove all rows with missing values 
df_without_missing =df.dropna()

let's see the shape of the datasets wiht and without the missing values:

In [45]:
print("The shape of the original dataset is: ", df.shape)
print("The shape of the dataset with missing values removed is: ", df_without_missing.shape)
print("The shape of the dataset with missing values is: ", df_with_missing.shape)

The shape of the original dataset is:  (891, 14)
The shape of the dataset with missing values removed is:  (714, 14)
The shape of the dataset with missing values is:  (177, 14)

In [46]:
# let's see the first five rows of the dataset with the missing values:

df_with_missing.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
5,0,3,1,NaN,0,0,8.4583,1,2,1,True,1,0,True
17,1,2,1,NaN,0,0,13.0000,2,1,1,True,2,1,True
19,1,3,0,NaN,0,0,7.2250,0,2,2,False,0,1,True
26,0,3,1,NaN,0,0,7.2250,0,2,1,True,0,0,True
28,1,3,0,NaN,0,0,7.8792,1,2,2,False,1,1,True

In [47]:
# let's see the first five rows of the datast without missing values:

df_without_missing.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,2,0,True

In [48]:
# check the names of the columns

print(df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [50]:
# Regression Imputation 

# split the data into x and y and we will oly take the columns with no missing values 
X =df_without_missing.drop(['age'], axis=1)
y = df_without_missing['age']

In [51]:
# split the data into train and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

In [54]:
# Random Forest Imputation 

rf_model = RandomForestRegressor(n_estimators=100, random_state=42)
rf_model.fit(X_train, y_train)

RandomForestRegressor(random_state=42)